#+TITLE: Gunnar Wrobel's Emacs configuration
#+OPTIONS: toc:4 h:4

**** Setup

The setup documentation can be found [[https://www.passwordstore.org][here]].

Simply initialize the store with the GnuPG key ID from the GnuPG setup above:

#+begin_src sh :var GNU_PG_KEY_ID=user-settings-gpg-key-id :results output
pass init $GNU_PG_KEY_ID
pass git init
pass git remote add origin git@gitlab.com:gwrobel/password-store.git
pass git push -u --all
#+end_src

#+RESULTS:
: Password store initialized for XYZ
: Leeres Git-Repository in ~/.password-store/.git/ initialisiert
: [master (Basis-Commit) 72ed975] Add current contents of password store.
:  1 file changed, 1 insertion(+)
:  create mode 100644 .gpg-id
: [master 0bb5284] Configure git repository for gpg file diff.
:  1 file changed, 1 insertion(+)
:  create mode 100644 .gitattributes

*** Alert

Useful for growl-like notifications (but you need the unstable =melpa= version hence a package pinned to melpa):

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package alert
  :ensure t
  :commands (alert)
  :init
  (setq alert-default-style 'osx-notifier)
  (setq alert-log-messages t))
#+END_SRC

#+RESULTS:
: [nil 22945 64763 370655 nil alert-remove-when-active (alert-message-remove (:message "TEST" :title "config.org" :icon nil :severity normal :category nil :buffer #<buffer config.org> :mode org-mode :data nil)) nil 0]


Documentation for =alert=: https://github.com/jwiegley/alert

